xwsdid/esp32-software-cup/esp32-ble-gateway/sdkconfig.defaults
# ESP32-S3 USB BLE Gateway — Stage 2
# USB Serial/JTAG for Dayu + NimBLE Central for mesh devices

CONFIG_IDF_TARGET="esp32s3"

# 日志输出到 UART0, USB 仅协议帧
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# USB Serial/JTAG
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=y

# WiFi / MQTT / HTTP — 网关不需要
CONFIG_ESP_WIFI_ENABLED=n

# BLE — NimBLE Central
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=4
CONFIG_BT_CTRL_BLE_MAX_ACT=4

# NimBLE host task stack — GATT 回调链深, 默认 4096 不够
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
CONFIG_BT_NIMBLE_TASK_STACK_SIZE=8192
